RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
/**************************************************************************//**
 * @file     nuc980.h
 * @brief    NUC980 peripheral access layer header file.
 *           This file contains all the peripheral register's definitions
 *           and memory mapping for NuMicro NUC980 MPU.
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2019 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
/**
   \mainpage NuMicro NUC980 Family Driver Reference Guide
   *
   * <b>Introduction</b>
   *
   * This user manual describes the usage of NUC980 family device driver
   *
   * <b>Disclaimer</b>
   *
   * The Software is furnished "AS IS", without warranty as to performance or results, and
   * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
   * warranties, express, implied or otherwise, with regard to the Software, its use, or
   * operation, including without limitation any and all warranties of merchantability, fitness
   * for a particular purpose, and non-infringement of intellectual property rights.
   *
   * <b>Important Notice</b>
   *
   * Nuvoton Products are neither intended nor warranted for usage in systems or equipment,
   * any malfunction or failure of which may cause loss of human life, bodily injury or severe
   * property damage. Such applications are deemed, "Insecure Usage".
   *
   * Insecure usage includes, but is not limited to: equipment for surgical implementation,
   * atomic energy control instruments, airplane or spaceship instruments, the control or
   * operation of dynamic, brake or safety systems designed for vehicular use, traffic signal
   * instruments, all types of safety devices, and other applications intended to support or
   * sustain life.
   *
   * All Insecure Usage shall be made at customer's risk, and in the event that third parties
   * lay claims to Nuvoton as a result of customer's Insecure Usage, customer shall indemnify
   * the damages and liabilities thus incurred by Nuvoton.
   *
   * Please note that all data and specifications are subject to change without notice. All the
   * trademarks of products and companies mentioned in this document belong to their respective
   * owners.
   *
   * <b>Copyright Notice</b>
   *
   * Copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
   */

#ifndef __NUC980_H__
    #define __NUC980_H__

    #include <stdint.h>

    /** @addtogroup NUC980_PERIPHERAL_MEM_MAP Peripheral Memory Base
    Memory Mapped Structure for NUC980 Peripheral
    @{
    */

    /*!< AHB peripherals */
    #define    SYS_BA    0xB0000000 /* Global Control */
    #define    CLK_BA    0xB0000200 /* Clock Control */
    #define    SDIC_BA   0xB0002000
    #define    EBI_BA    0xB0010000 /* EBI Control */
    #define    GPIO_BA   0xB0004000
    #define    PDMA0_BA  0xB0008000
    #define    PDMA1_BA  0xB0009000
    #define    EMC0_BA   0xB0012000
    #define    EHCI_BA   0xB0015000
    #define    USBD_BA   0xB0016000
    #define    OHCI_BA   0xB0017000
    #define    SDH_BA    0xB0018000
    #define    FMI_BA    0xB0019000
    #define    CRPT_BA   0xB001C000
    #define    I2S_BA    0xB0020000
    #define    EMC1_BA   0xB0022000
    #define    CAP0_BA   0xB0024000
    #define    CAP1_BA   0xB0014000

    #define    PA_BA     0xB0004000
    #define    PB_BA     0xB0004040
    #define    PC_BA     0xB0004080
    #define    PD_BA     0xB00040C0
    #define    PE_BA     0xB0004100
    #define    PF_BA     0xB0004140
    #define    PG_BA     0xB0004180

    /*!< APB peripherals */

    #define    WDT_BA    0xB0040000 /* Watch Dog Timer */
    #define    WWDT_BA   0xB0040100 /* Windows Watch Dog Timer */
    #define    RTC_BA    0xB0041000
    #define    AIC_BA    0xB0042000 /* Interrupt Controller */
    #define    ADC_BA    0xB0043000
    #define    ETMR0_BA  0xB0050000 /* ETimer0 */
    #define    ETMR1_BA  0xB0050100 /* ETimer1 */
    #define    ETMR2_BA  0xB0051000 /* ETimer2 */
    #define    ETMR3_BA  0xB0051100 /* ETimer3 */
    #define    ETMR4_BA  0xB0052000 /* ETimer4 */
    #define    ETMR5_BA  0xB0052100 /* ETimer5 */
    #define    PWM0_BA   0xB0058000
    #define    PWM1_BA   0xB0059000
    #define    QSPI0_BA  0xB0060000
    #define    SPI0_BA   0xB0061000
    #define    SPI1_BA   0xB0062000
    #define    UART0_BA  0xB0070000 /* UART0 Control */
    #define    UART1_BA  0xB0071000 /* UART1 Control */
    #define    UART2_BA  0xB0072000
    #define    UART3_BA  0xB0073000
    #define    UART4_BA  0xB0074000
    #define    UART5_BA  0xB0075000
    #define    UART6_BA  0xB0076000
    #define    UART7_BA  0xB0077000
    #define    UART8_BA  0xB0078000
    #define    UART9_BA  0xB0079000
    #define    I2C0_BA   0xB0080000
    #define    I2C1_BA   0xB0081000
    #define    I2C2_BA   0xB0082000
    #define    I2C3_BA   0xB0083000
    #define    SC0_BA    0xB0090000
    #define    SC1_BA    0xB0091000
    #define    CAN0_BA   0xB00A0000
    #define    CAN1_BA   0xB00A1000
    #define    CAN2_BA   0xB00A2000
    #define    CAN3_BA   0xB00A3000

    /*@}*/ /* end of group NUC980_PERIPHERAL_MEM_MAP */

    /******************************************************************************/
    /*                Device Specific Peripheral registers structures             */
    /******************************************************************************/
    /** @addtogroup REGISTER Control Register
    NUC980 Device Specific Peripheral registers structures
    @{
    */

    /*---------------------- System Manger Controller -------------------------*/
    /**
    @addtogroup SYS System Manger Controller(SYS)
    Memory Mapped Structure for SYS Controller
    @{ */

    #define    REG_SYS_PDID         (SYS_BA+0x000)  /*!< Product Identifier Register */
    #define    REG_SYS_PWRON        (SYS_BA+0x004)  /*!< Power-On Setting Register */
    #define    REG_SYS_ARBCON       (SYS_BA+0x008)  /*!< Arbitration Control Register */
    #define    REG_SYS_LVRDCR       (SYS_BA+0x020)  /*!< Low Voltage Reset & Detect Control Register */
    #define    REG_SYS_MISCFCR      (SYS_BA+0x030)  /*!< Miscellaneous Function Control Register */
    #define    REG_SYS_MISCIER      (SYS_BA+0x040)  /*!< Miscellaneous Interrupt Enable Register */
    #define    REG_SYS_MISCISR      (SYS_BA+0x044)  /*!< Miscellaneous Interrupt Status Register */
    #define    REG_SYS_WKUPSER0     (SYS_BA+0x050)  /*!< System Wakeup Source Enable Register0 */
    #define    REG_SYS_WKUPSER1     (SYS_BA+0x054)  /*!< System Wakeup Source Enable Register1 */
    #define    REG_SYS_WKUPSSR0     (SYS_BA+0x058)  /*!< System Wakeup Source Status Register0 */
    #define    REG_SYS_WKUPSSR1     (SYS_BA+0x05C)  /*!< System Wakeup Source Status Register1 */
    #define    REG_SYS_AHBIPRST     (SYS_BA+0x060)  /*!< AHB IP Reset Control Register */
    #define    REG_SYS_APBIPRST0    (SYS_BA+0x064)  /*!< APB IP Reset Control Register 0 */
    #define    REG_SYS_APBIPRST1    (SYS_BA+0x068)  /*!< APB IP Reset Control Register 1 */
    #define    REG_SYS_RSTSTS       (SYS_BA+0x06C)  /*!< Reset Source Active Status Register */
    #define    REG_SYS_GPA_MFPL     (SYS_BA+0x070)  /*!< GPIOA Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPA_MFPH     (SYS_BA+0x074)  /*!< GPIOA High Byte Multiple Function Control Register */
    #define    REG_SYS_GPB_MFPL     (SYS_BA+0x078)  /*!< GPIOB Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPB_MFPH     (SYS_BA+0x07C)  /*!< GPIOB High Byte Multiple Function Control Register */
    #define    REG_SYS_GPC_MFPL     (SYS_BA+0x080)  /*!< GPIOC Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPC_MFPH     (SYS_BA+0x084)  /*!< GPIOC High Byte Multiple Function Control Register */
    #define    REG_SYS_GPD_MFPL     (SYS_BA+0x088)  /*!< GPIOD Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPD_MFPH     (SYS_BA+0x08C)  /*!< GPIOD High Byte Multiple Function Control Register */
    #define    REG_SYS_GPE_MFPL     (SYS_BA+0x090)  /*!< GPIOE Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPE_MFPH     (SYS_BA+0x094)  /*!< GPIOE High Byte Multiple Function Control Register */
    #define    REG_SYS_GPF_MFPL     (SYS_BA+0x098)  /*!< GPIOF Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPF_MFPH     (SYS_BA+0x09C)  /*!< GPIOF High Byte Multiple Function Control Register */
    #define    REG_SYS_GPG_MFPL     (SYS_BA+0x0A0)  /*!< GPIOG Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPG_MFPH     (SYS_BA+0x0A4)  /*!< GPIOG High Byte Multiple Function Control Register */
    #define    REG_SYS_GPH_MFPL     (SYS_BA+0x0A8)  /*!< GPIOH Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPH_MFPH     (SYS_BA+0x0AC)  /*!< GPIOH High Byte Multiple Function Control Register */
    #define    REG_SYS_GPI_MFPL     (SYS_BA+0x0B0)  /*!< GPIOI Low Byte Multiple Function Control Register */
    #define    REG_SYS_GPI_MFPH     (SYS_BA+0x0B4)  /*!< GPIOI High Byte Multiple Function Control Register */
    #define    REG_SYS_GPJ_MFPL     (SYS_BA+0x0B8)  /*!< GPIOJ Low Byte Multiple Function Control Register */
    #define    REG_SYS_DDR_DSCTL    (SYS_BA+0x0F0)  /*!< DDR I/O Driving Strength Control Register */
    #define    REG_SYS_PORDISCR     (SYS_BA+0x100)  /*!< Power-On-Reset Disable Control Register */
    #define    REG_SYS_ICEDBGCR     (SYS_BA+0x104)  /*!< ICE Debug Interface Control Register */
    #define    REG_SYS_ERRADDCR     (SYS_BA+0x108)  /*!< Error Response Address Control Regsiter */
    #define    REG_SYS_REGWPCTL     (SYS_BA+0x1FC)  /*!< Register Write-Protection Control Register */

