RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    #define     REG_I2S_CON            (I2S_BA+0x00)      /*!< Audio controller control register */
    #define     REG_I2S_RESET          (I2S_BA+0x04)      /*!< Sub block reset control register */
    #define     REG_I2S_RDESB          (I2S_BA+0x08)      /*!< DMA destination base address register for record */
    #define     REG_I2S_RDES_LENGTH    (I2S_BA+0x0C)      /*!< DMA destination length register for record */
    #define     REG_I2S_RDESC          (I2S_BA+0x10)      /*!< DMA destination current address for record */
    #define     REG_I2S_PDESB          (I2S_BA+0x14)      /*!< DMA destination current address for play */
    #define     REG_I2S_PDES_LENGTH    (I2S_BA+0x18)      /*!< DMA destination length register for play */
    #define     REG_I2S_PDESC          (I2S_BA+0x1C)      /*!< DMA destination current address register for play */
    #define     REG_I2S_RSR            (I2S_BA+0x20)      /*!< Record status register */
    #define     REG_I2S_PSR            (I2S_BA+0x24)      /*!< Play status register */
    #define     REG_I2S_I2SCON         (I2S_BA+0x28)      /*!< I2S control register */
    #define     REG_I2S_COUNTER        (I2S_BA+0x2C)      /*!< DMA count down values */
    #define     REG_I2S_PCMCON         (I2S_BA+0x30)      /*!< PCM interface control register */
    #define     REG_I2S_PCMS1ST        (I2S_BA+0x34)      /*!< PCM interface slot1 start register */
    #define     REG_I2S_PCMS2ST        (I2S_BA+0x38)      /*!< PCM interface slot2 start register */
    #define     REG_I2S_RDESB2         (I2S_BA+0x40)      /*!< DMA destination base address register for record right channel */
    #define     REG_I2S_PDESB2         (I2S_BA+0x44)      /*!< DMA destination base address register for play right channel */

    /**@}*/ /* end of I2S register group */


    /*---------------------- Flash Memory Interface -------------------------*/
    /**
    @addtogroup FMI Flash Memory Interface(FMI)
    Memory Mapped Structure for FMI Controller
    @{ */

    /* DMAC Control Registers*/
    #define     REG_FMI_BUFFER      (FMI_BA+0x000)   /*!< FMI Embedded Buffer Word */
    #define     REG_FMI_DMACTL      (FMI_BA+0x400)   /*!< FMI DMA Control Register */
    #define     REG_FMI_DMASA       (FMI_BA+0x408)   /*!< FMI DMA Transfer Starting Address Register */
    #define     REG_FMI_DMABCNT     (FMI_BA+0x40C)   /*!< FMI DMA Transfer Byte Count Register */
    #define     REG_FMI_DMAINTEN    (FMI_BA+0x410)   /*!< FMI DMA Interrupt Enable Register */
    #define     REG_FMI_DMAINTSTS   (FMI_BA+0x414)   /*!< FMI DMA Interrupt Status Register */

    #define     REG_FMI_CTL         (FMI_BA+0x800)   /*!< Global Control and Status Register */
    #define     REG_FMI_INTEN       (FMI_BA+0x804)   /*!< Global Interrupt Control Register */
    #define     REG_FMI_INTSTS      (FMI_BA+0x808)   /*!< Global Interrupt Status Register */

    /* eMMC Registers */
    #define     REG_FMI_EMMCCTL     (FMI_BA+0x820)   /*!< eMMC control and status register */
    #define     REG_FMI_EMMCCMD     (FMI_BA+0x824)   /*!< eMMC command argument register */
    #define     REG_FMI_EMMCINTEN   (FMI_BA+0x828)   /*!< eMMC interrupt enable register */
    #define     REG_FMI_EMMCINTSTS  (FMI_BA+0x82C)   /*!< eMMC interrupt status register */
    #define     REG_FMI_EMMCRESP0   (FMI_BA+0x830)   /*!< eMMC receive response token register 0 */
    #define     REG_FMI_EMMCRESP1   (FMI_BA+0x834)   /*!< eMMC receive response token register 1 */
    #define     REG_FMI_EMMCBLEN    (FMI_BA+0x838)   /*!< eMMC block length register */
    #define     REG_FMI_EMMCTOUT    (FMI_BA+0x83C)   /*!< eMMC block length register */

    /* NAND-type Flash Registers */
    #define     REG_NANDCTL         (FMI_BA+0x8A0)   /*!< NAND Flash Control and Status Register */
    #define     REG_NANDTMCTL       (FMI_BA+0x8A4)   /*!< NAND Flash Timing Control Register */
    #define     REG_NANDINTEN       (FMI_BA+0x8A8)   /*!< NAND Flash Interrupt Control Register */
    #define     REG_NANDINTSTS      (FMI_BA+0x8AC)   /*!< NAND Flash Interrupt Status Register */
    #define     REG_NANDCMD         (FMI_BA+0x8B0)   /*!< NAND Flash Command Port Register */
    #define     REG_NANDADDR        (FMI_BA+0x8B4)   /*!< NAND Flash Address Port Register */
    #define     REG_NANDDATA        (FMI_BA+0x8B8)   /*!< NAND Flash Data Port Register */
    #define     REG_NANDRACTL       (FMI_BA+0x8BC)   /*!< NAND Flash Redundant Area Control Register */
    #define     REG_NANDECTL        (FMI_BA+0x8C0)   /*!< NAND Flash Extend Control Regsiter */
    #define     REG_NANDECCES0      (FMI_BA+0x8D0)   /*!< NAND Flash ECC Error Status 0 */
    #define     REG_NANDECCES1      (FMI_BA+0x8D4)   /*!< NAND Flash ECC Error Status 1 */
    #define     REG_NANDECCES2      (FMI_BA+0x8D8)   /*!< NAND Flash ECC Error Status 2 */
    #define     REG_NANDECCES3      (FMI_BA+0x8DC)   /*!< NAND Flash ECC Error Status 3 */
    #define     REG_NANDPROTA0      (FMI_BA+0x8E0)   /*!< NAND Flash Protect Region End Address 0 */
    #define     REG_NANDPROTA1      (FMI_BA+0x8E4)   /*!< NAND Flash Protect Region End Address 1 */

    /* NAND-type Flash BCH Error Address Registers */
    #define     REG_NANDECCEA0      (FMI_BA+0x900)   /*!< NAND Flash ECC Error Byte Address 0 */
    #define     REG_NANDECCEA1      (FMI_BA+0x904)   /*!< NAND Flash ECC Error Byte Address 1 */
    #define     REG_NANDECCEA2      (FMI_BA+0x908)   /*!< NAND Flash ECC Error Byte Address 2 */
    #define     REG_NANDECCEA3      (FMI_BA+0x90C)   /*!< NAND Flash ECC Error Byte Address 3 */
    #define     REG_NANDECCEA4      (FMI_BA+0x910)   /*!< NAND Flash ECC Error Byte Address 4 */
    #define     REG_NANDECCEA5      (FMI_BA+0x914)   /*!< NAND Flash ECC Error Byte Address 5 */
    #define     REG_NANDECCEA6      (FMI_BA+0x918)   /*!< NAND Flash ECC Error Byte Address 6 */
    #define     REG_NANDECCEA7      (FMI_BA+0x91C)   /*!< NAND Flash ECC Error Byte Address 7 */
    #define     REG_NANDECCEA8      (FMI_BA+0x920)   /*!< NAND Flash ECC Error Byte Address 8 */
    #define     REG_NANDECCEA9      (FMI_BA+0x924)   /*!< NAND Flash ECC Error Byte Address 9 */
    #define     REG_NANDECCEA10     (FMI_BA+0x928)   /*!< NAND Flash ECC Error Byte Address 10 */
    #define     REG_NANDECCEA11     (FMI_BA+0x92C)   /*!< NAND Flash ECC Error Byte Address 11 */

