RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    /* NAND-type Flash BCH Error Data Registers */
    #define     REG_NANDECCED0      (FMI_BA+0x960)   /*!< NAND Flash ECC Error Data Register 0 */
    #define     REG_NANDECCED1      (FMI_BA+0x964)   /*!< NAND Flash ECC Error Data Register 1 */
    #define     REG_NANDECCED2      (FMI_BA+0x968)   /*!< NAND Flash ECC Error Data Register 2 */
    #define     REG_NANDECCED3      (FMI_BA+0x96C)   /*!< NAND Flash ECC Error Data Register 3 */
    #define     REG_NANDECCED4      (FMI_BA+0x970)   /*!< NAND Flash ECC Error Data Register 4 */
    #define     REG_NANDECCED5      (FMI_BA+0x974)   /*!< NAND Flash ECC Error Data Register 5 */

    /* NAND-type Flash Redundant Area Registers */
    #define     REG_NANDRA0         (FMI_BA+0xA00)   /*!< NAND Flash Redundant Area Register */
    #define     REG_NANDRA1         (FMI_BA+0xA04)   /*!< NAND Flash Redundant Area Register */

    /**@}*/ /* end of FMI register group */


    /*---------------------- SD/SDIO Host Controller -------------------------*/
    /**
    @addtogroup SDH SD/SDIO Host Controller(SDH)
    Memory Mapped Structure for SDH Controller
    @{ */

    /* DMAC Control Registers*/
    #define     REG_SDH_FB0         (SDH_BA+0x000)   /*!< SD Host Embedded Buffer Word */
    #define     REG_SDH_DMACTL      (SDH_BA+0x400)   /*!< SD Host DMA Control and Status Register */
    #define     REG_SDH_DMASA       (SDH_BA+0x408)   /*!< SD Host DMA Transfer Starting Address Register */
    #define     REG_SDH_DMABCNT     (SDH_BA+0x40C)   /*!< SD Host DMA Transfer Byte Count Register */
    #define     REG_SDH_DMAINTEN    (SDH_BA+0x410)   /*!< SD Host DMA Interrupt Enable Register */
    #define     REG_SDH_DMAINTSTS   (SDH_BA+0x414)   /*!< SD Host DMA Interrupt Status Register */

    #define     REG_SDH_GCTL        (SDH_BA+0x800)   /*!< SD Host Global Control and Status Register */
    #define     REG_SDH_GINTEN      (SDH_BA+0x804)   /*!< SD Host Global Interrupt Control Register */
    #define     REG_SDH_GINTSTS     (SDH_BA+0x808)   /*!< SD Host Global Interrupt Status Register */

    /* Secure Digit Registers */
    #define     REG_SDH_CTL         (SDH_BA+0x820)   /*!< SD Host control and status register */
    #define     REG_SDH_CMD         (SDH_BA+0x824)   /*!< SD Host command argument register */
    #define     REG_SDH_INTEN       (SDH_BA+0x828)   /*!< SD Host interrupt enable register */
    #define     REG_SDH_INTSTS      (SDH_BA+0x82C)   /*!< SD Host interrupt status register */
    #define     REG_SDH_RESP0       (SDH_BA+0x830)   /*!< SD Host receive response token register 0 */
    #define     REG_SDH_RESP1       (SDH_BA+0x834)   /*!< SD Host receive response token register 1 */
    #define     REG_SDH_BLEN        (SDH_BA+0x838)   /*!< SD Host block length register */
    #define     REG_SDH_TMOUT       (SDH_BA+0x83C)   /*!< SD Host Response/Data-in Time-out register */
    #define     REG_SDH_ECTL        (SDH_BA+0x840)   /*!< SD Host Extend Control Register */

    /**@}*/ /* end of SDH register group */

    /*---------------------- Serial Peripheral Interface Controller -------------------------*/
    /**
    @addtogroup SPI Serial Peripheral Interface Controller(SPI)
    Memory Mapped Structure for SPI Controller
    @{ */

    #define     REG_QSPI0_CTL     (QSPI0_BA+0x00)    /*!< Control Register Address */
    #define     REG_QSPI0_CLKDIV  (QSPI0_BA+0x04)    /*!< Divider Register Address */
    #define     REG_QSPI0_SSCTL   (QSPI0_BA+0x08)    /*!< Slave Select Register Address */
    #define     REG_QSPI0_PDMACTL (QSPI0_BA+0x0C)    /*!< PDMA Control Register Address */
    #define     REG_QSPI0_FIFOCTL (QSPI0_BA+0x10)    /*!< FIFO Control Register Address */
    #define     REG_QSPI0_STATUS  (QSPI0_BA+0x14)    /*!< Status Register Address */
    #define     REG_QSPI0_TX      (QSPI0_BA+0x20)    /*!< Data Transmit Register Address */
    #define     REG_QSPI0_RX      (QSPI0_BA+0x30)    /*!< Data Receive Register Address */

    #define     REG_SPI0_CTL      (SPI0_BA+0x00)    /*!< Control Register Address */
    #define     REG_SPI0_CLKDIV   (SPI0_BA+0x04)    /*!< Divider Register Address */
    #define     REG_SPI0_SSCTL    (SPI0_BA+0x08)    /*!< Slave Select Register Address */
    #define     REG_SPI0_PDMACTL  (SPI0_BA+0x0C)    /*!< PDMA Control Register Address */
    #define     REG_SPI0_FIFOCTL  (SPI0_BA+0x10)    /*!< FIFO Control Register Address */
    #define     REG_SPI0_STATUS   (SPI0_BA+0x14)    /*!< Status Register Address */
    #define     REG_SPI0_TX       (SPI0_BA+0x20)    /*!< Data Transmit Register Address */
    #define     REG_SPI0_RX       (SPI0_BA+0x30)    /*!< Data Receive Register Address */

    #define     REG_SPI1_CTL      (SPI1_BA+0x00)    /*!< Control Register Address */
    #define     REG_SPI1_CLKDIV   (SPI1_BA+0x04)    /*!< Divider Register Address */
    #define     REG_SPI1_SSCTL    (SPI1_BA+0x08)    /*!< Slave Select Register Address */
    #define     REG_SPI1_PDMACTL  (SPI1_BA+0x0C)    /*!< PDMA Control Register Address */
    #define     REG_SPI1_FIFOCTL  (SPI1_BA+0x10)    /*!< FIFO Control Register Address */
    #define     REG_SPI1_STATUS   (SPI1_BA+0x14)    /*!< Status Register Address */
    #define     REG_SPI1_TX       (SPI1_BA+0x20)    /*!< Data Transmit Register Address */
    #define     REG_SPI1_RX       (SPI1_BA+0x30)    /*!< Data Receive Register Address */

    /**@}*/ /* end of SPI register group */



    /*---------------------- Cryptographic Accelerator -------------------------*/
    /**
    @addtogroup CRYPTO Cryptographic Accelerator(CRYPTO)
    Memory Mapped Structure for Cryptographic Accelerator registers
    @{ */

    /* Crypto Control Registers */
    #define     CRPT_INTEN          (CRPT_BA+0x000)  /*!< Crypto Interrupt Enable Control Register      */
    #define     CRPT_INTSTS         (CRPT_BA+0x004)  /*!< Crypto Interrupt Flag                         */

    /* PRNG Registers */
    #define     CRPT_PRNG_CTL       (CRPT_BA+0x008)  /*!< PRNG Control Register                         */
    #define     CRPT_PRNG_SEED      (CRPT_BA+0x00C)  /*!< Seed for PRNG                                 */
    #define     CRPT_PRNG_KEY0      (CRPT_BA+0x010)  /*!< PRNG Generated Key 0                          */
    #define     CRPT_PRNG_KEY1      (CRPT_BA+0x014)  /*!< PRNG Generated Key 1                          */
    #define     CRPT_PRNG_KEY2      (CRPT_BA+0x018)  /*!< PRNG Generated Key 2                          */
    #define     CRPT_PRNG_KEY3      (CRPT_BA+0x01C)  /*!< PRNG Generated Key 3                          */
    #define     CRPT_PRNG_KEY4      (CRPT_BA+0x020)  /*!< PRNG Generated Key 4                          */
    #define     CRPT_PRNG_KEY5      (CRPT_BA+0x024)  /*!< PRNG Generated Key 5                          */
    #define     CRPT_PRNG_KEY6      (CRPT_BA+0x028)  /*!< PRNG Generated Key 6                          */
    #define     CRPT_PRNG_KEY7      (CRPT_BA+0x02C)  /*!< PRNG Generated Key 7                          */

