RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    /*
    UART1 Control Registers
    */
    #define     REG_UART1_RBR   (UART1_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART1_THR   (UART1_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART1_IER   (UART1_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART1_FCR   (UART1_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART1_LCR   (UART1_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART1_MCR   (UART1_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART1_MSR   (UART1_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART1_FSR       (UART1_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART1_ISR   (UART1_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART1_TOR       (UART1_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART1_BAUD      (UART1_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART1_IRCR      (UART1_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART1_ALT_CSR   (UART1_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART1_FUN_SEL   (UART1_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART1_LIN_CTL   (UART1_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART1_LIN_SR    (UART1_BA+0x38)  /*!< LIN Status Register */

    /*
    UART2 Control Registers
    */
    #define     REG_UART2_RBR   (UART2_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART2_THR   (UART2_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART2_IER   (UART2_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART2_FCR   (UART2_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART2_LCR   (UART2_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART2_MCR   (UART2_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART2_MSR   (UART2_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART2_FSR   (UART2_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART2_ISR   (UART2_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART2_TOR   (UART2_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART2_BAUD  (UART2_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART2_IRCR  (UART2_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART2_ALT_CSR   (UART2_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART2_FUN_SEL   (UART2_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART2_LIN_CTL   (UART2_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART2_LIN_SR    (UART2_BA+0x38)  /*!< LIN Status Register */

    /*
    UART3 Control Registers
    */
    #define     REG_UART3_RBR   (UART3_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART3_THR   (UART3_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART3_IER   (UART3_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART3_FCR   (UART3_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART3_LCR   (UART3_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART3_MCR   (UART3_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART3_MSR   (UART3_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART3_FSR   (UART3_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART3_ISR   (UART3_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART3_TOR   (UART3_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART3_BAUD  (UART3_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART3_IRCR  (UART3_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART3_ALT_CSR   (UART3_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART3_FUN_SEL   (UART3_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART3_LIN_CTL   (UART3_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART3_LIN_SR    (UART3_BA+0x38)  /*!< LIN Status Register */


    /*
    UART4 Control Registers
    */
    #define     REG_UART4_RBR   (UART4_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART4_THR   (UART4_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART4_IER   (UART4_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART4_FCR   (UART4_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART4_LCR   (UART4_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART4_MCR   (UART4_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART4_MSR   (UART4_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART4_FSR   (UART4_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART4_ISR   (UART4_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART4_TOR   (UART4_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART4_BAUD  (UART4_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART4_IRCR  (UART4_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART4_ALT_CSR   (UART4_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART4_FUN_SEL   (UART4_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART4_LIN_CTL   (UART4_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART4_LIN_SR    (UART4_BA+0x38)  /*!< LIN Status Register */

    /*
    UART5 Control Registers
    */
    #define     REG_UART5_RBR   (UART5_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART5_THR   (UART5_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART5_IER   (UART5_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART5_FCR   (UART5_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART5_LCR   (UART5_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART5_MCR   (UART5_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART5_MSR   (UART5_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART5_FSR   (UART5_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART5_ISR   (UART5_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART5_TOR   (UART5_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART5_BAUD  (UART5_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART5_IRCR  (UART5_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART5_ALT_CSR   (UART5_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART5_FUN_SEL   (UART5_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART5_LIN_CTL   (UART5_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART5_LIN_SR    (UART5_BA+0x38)  /*!< LIN Status Register */

