RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    /*
    UART6 Control Registers
    */
    #define     REG_UART6_RBR   (UART6_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART6_THR   (UART6_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART6_IER   (UART6_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART6_FCR   (UART6_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART6_LCR   (UART6_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART6_MCR   (UART6_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART6_MSR   (UART6_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART6_FSR   (UART6_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART6_ISR   (UART6_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART6_TOR   (UART6_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART6_BAUD  (UART6_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART6_IRCR  (UART6_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART6_ALT_CSR   (UART6_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART6_FUN_SEL   (UART6_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART6_LIN_CTL   (UART6_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART6_LIN_SR    (UART6_BA+0x38)  /*!< LIN Status Register */

    /*
    UART7 Control Registers
    */
    #define     REG_UART7_RBR   (UART7_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART7_THR   (UART7_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART7_IER   (UART7_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART7_FCR   (UART7_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART7_LCR   (UART7_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART7_MCR   (UART7_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART7_MSR   (UART7_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART7_FSR   (UART7_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART7_ISR   (UART7_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART7_TOR   (UART7_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART7_BAUD  (UART7_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART7_IRCR  (UART7_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART7_ALT_CSR   (UART7_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART7_FUN_SEL   (UART7_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART7_LIN_CTL   (UART7_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART7_LIN_SR    (UART7_BA+0x38)  /*!< LIN Status Register */

    /*
    UART8 Control Registers
    */
    #define     REG_UART8_RBR   (UART8_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART8_THR   (UART8_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART8_IER   (UART8_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART8_FCR   (UART8_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART8_LCR   (UART8_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART8_MCR   (UART8_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART8_MSR   (UART8_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART8_FSR   (UART8_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART8_ISR   (UART8_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART8_TOR   (UART8_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART8_BAUD  (UART8_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART8_IRCR  (UART8_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART8_ALT_CSR   (UART8_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART8_FUN_SEL   (UART8_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART8_LIN_CTL   (UART8_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART8_LIN_SR    (UART8_BA+0x38)  /*!< LIN Status Register */

    /*
    UART9 Control Registers
    */
    #define     REG_UART9_RBR   (UART9_BA+0x00)  /*!< Receive Buffer Register */
    #define     REG_UART9_THR   (UART9_BA+0x00)  /*!< Transmit Holding Register */
    #define     REG_UART9_IER   (UART9_BA+0x04)  /*!< Interrupt Enable Register */
    #define     REG_UART9_FCR   (UART9_BA+0x08)  /*!< FIFO Control Register */
    #define     REG_UART9_LCR   (UART9_BA+0x0C)  /*!< Line Control Register */
    #define     REG_UART9_MCR   (UART9_BA+0x10)  /*!< Modem Control Register */
    #define     REG_UART9_MSR   (UART9_BA+0x14)  /*!< MODEM Status Register */
    #define     REG_UART9_FSR   (UART9_BA+0x18)  /*!< FIFO Status Register */
    #define     REG_UART9_ISR   (UART9_BA+0x1C)  /*!< Interrupt Status Control Register */
    #define     REG_UART9_TOR   (UART9_BA+0x20)  /*!< Time-out Register */
    #define     REG_UART9_BAUD  (UART9_BA+0x24)  /*!< Baud Rate Divider Register */
    #define     REG_UART9_IRCR  (UART9_BA+0x28)  /*!< IrDA Control Register */
    #define     REG_UART9_ALT_CSR   (UART9_BA+0x2C)  /*!< Alternate Control Register */
    #define     REG_UART9_FUN_SEL   (UART9_BA+0x30)  /*!< UART Function Select REgister */
    #define     REG_UART9_LIN_CTL   (UART9_BA+0x34)  /*!< UART LIN Control Register */
    #define     REG_UART9_LIN_SR    (UART9_BA+0x38)  /*!< LIN Status Register */


    /**@}*/ /* end of UART register group */



    /*---------------------- Enhance Timer Controller -------------------------*/
    /**
    @addtogroup ETIMER Enhance Timer Controller(ETIMER)
    Memory Mapped Structure for TIMER Controller
    @{ */

    #define     REG_ETMR0_CTL       (ETMR0_BA+0x00)  /*!< Enhance Timer 0 Control Register */
    #define     REG_ETMR0_PRECNT    (ETMR0_BA+0x04)  /*!< Enhance Timer 0 Pre-Scale Counter Register */
    #define     REG_ETMR0_CMPR      (ETMR0_BA+0x08)  /*!< Enhance Timer 0 Compare Register */
    #define     REG_ETMR0_IER       (ETMR0_BA+0x0C)  /*!< Enhance Timer 0 Interrupt Enable Register */
    #define     REG_ETMR0_ISR       (ETMR0_BA+0x10)  /*!< Enhance Timer 0 Interrupt Status Register  */
    #define     REG_ETMR0_DR        (ETMR0_BA+0x14)  /*!< Enhance Timer 0 Data Register */
    #define     REG_ETMR0_TCAP      (ETMR0_BA+0x18)  /*!< Enhance Timer 0 Capture Data Register  */
    #define     REG_ETMR0_ECTL      (ETMR0_BA+0x20)  /*!< Enhance Timer 0 Extended Control Register  */

