RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    #define     REG_ETMR1_CTL       (ETMR1_BA+0x00)  /*!< Enhance Timer 1 Control Register */
    #define     REG_ETMR1_PRECNT    (ETMR1_BA+0x04)  /*!< Enhance Timer 1 Pre-Scale Counter Register */
    #define     REG_ETMR1_CMPR      (ETMR1_BA+0x08)  /*!< Enhance Timer 1 Compare Register */
    #define     REG_ETMR1_IER       (ETMR1_BA+0x0C)  /*!< Enhance Timer 1 Interrupt Enable Register */
    #define     REG_ETMR1_ISR       (ETMR1_BA+0x10)  /*!< Enhance Timer 1 Interrupt Status Register  */
    #define     REG_ETMR1_DR        (ETMR1_BA+0x14)  /*!< Enhance Timer 1 Data Register */
    #define     REG_ETMR1_TCAP      (ETMR1_BA+0x18)  /*!< Enhance Timer 1 Capture Data Register  */
    #define     REG_ETMR1_ECTL      (ETMR1_BA+0x20)  /*!< Enhance Timer 1 Extended Control Register  */

    #define     REG_ETMR2_CTL       (ETMR2_BA+0x00)  /*!< Enhance Timer 2 Control Register */
    #define     REG_ETMR2_PRECNT    (ETMR2_BA+0x04)  /*!< Enhance Timer 2 Pre-Scale Counter Register */
    #define     REG_ETMR2_CMPR      (ETMR2_BA+0x08)  /*!< Enhance Timer 2 Compare Register */
    #define     REG_ETMR2_IER       (ETMR2_BA+0x0C)  /*!< Enhance Timer 2 Interrupt Enable Register */
    #define     REG_ETMR2_ISR       (ETMR2_BA+0x10)  /*!< Enhance Timer 2 Interrupt Status Register  */
    #define     REG_ETMR2_DR        (ETMR2_BA+0x14)  /*!< Enhance Timer 2 Data Register */
    #define     REG_ETMR2_TCAP      (ETMR2_BA+0x18)  /*!< Enhance Timer 2 Capture Data Register  */
    #define     REG_ETMR2_ECTL      (ETMR2_BA+0x20)  /*!< Enhance Timer 2 Extended Control Register  */

    #define     REG_ETMR3_CTL       (ETMR3_BA+0x00)  /*!< Enhance Timer 3 Control Register */
    #define     REG_ETMR3_PRECNT    (ETMR3_BA+0x04)  /*!< Enhance Timer 3 Pre-Scale Counter Register */
    #define     REG_ETMR3_CMPR      (ETMR3_BA+0x08)  /*!< Enhance Timer 3 Compare Register */
    #define     REG_ETMR3_IER       (ETMR3_BA+0x0C)  /*!< Enhance Timer 3 Interrupt Enable Register */
    #define     REG_ETMR3_ISR       (ETMR3_BA+0x10)  /*!< Enhance Timer 3 Interrupt Status Register  */
    #define     REG_ETMR3_DR        (ETMR3_BA+0x14)  /*!< Enhance Timer 3 Data Register */
    #define     REG_ETMR3_TCAP      (ETMR3_BA+0x18)  /*!< Enhance Timer 3 Capture Data Register  */
    #define     REG_ETMR3_ECTL      (ETMR3_BA+0x20)  /*!< Enhance Timer 3 Extended Control Register  */

    #define     REG_ETMR4_CTL       (ETMR4_BA+0x00)  /*!< Enhance Timer 4 Control Register */
    #define     REG_ETMR4_PRECNT    (ETMR4_BA+0x04)  /*!< Enhance Timer 4 Pre-Scale Counter Register */
    #define     REG_ETMR4_CMPR      (ETMR4_BA+0x08)  /*!< Enhance Timer 4 Compare Register */
    #define     REG_ETMR4_IER       (ETMR4_BA+0x0C)  /*!< Enhance Timer 4 Interrupt Enable Register */
    #define     REG_ETMR4_ISR       (ETMR4_BA+0x10)  /*!< Enhance Timer 4 Interrupt Status Register  */
    #define     REG_ETMR4_DR        (ETMR4_BA+0x14)  /*!< Enhance Timer 4 Data Register */
    #define     REG_ETMR4_TCAP      (ETMR4_BA+0x18)  /*!< Enhance Timer 4 Capture Data Register  */
    #define     REG_ETMR4_ECTL      (ETMR4_BA+0x20)  /*!< Enhance Timer 4 Extended Control Register  */

    #define     REG_ETMR5_CTL       (ETMR5_BA+0x00)  /*!< Enhance Timer 5 Control Register */
    #define     REG_ETMR5_PRECNT    (ETMR5_BA+0x04)  /*!< Enhance Timer 5 Pre-Scale Counter Register */
    #define     REG_ETMR5_CMPR      (ETMR5_BA+0x08)  /*!< Enhance Timer 5 Compare Register */
    #define     REG_ETMR5_IER       (ETMR5_BA+0x0C)  /*!< Enhance Timer 5 Interrupt Enable Register */
    #define     REG_ETMR5_ISR       (ETMR5_BA+0x10)  /*!< Enhance Timer 5 Interrupt Status Register  */
    #define     REG_ETMR5_DR        (ETMR5_BA+0x14)  /*!< Enhance Timer 5 Data Register */
    #define     REG_ETMR5_TCAP      (ETMR5_BA+0x18)  /*!< Enhance Timer 5 Capture Data Register  */
    #define     REG_ETMR5_ECTL      (ETMR5_BA+0x20)  /*!< Enhance Timer 5 Extended Control Register  */

    /**@}*/ /* end of ETIMER register group */

    /*---------------------- WDT Controller -------------------------*/
    /**
    @addtogroup WDT Watch Dog Timer Controller(WDT)
    Memory Mapped Structure for WDT Controller
    @{ */

    #define     REG_WDT_CTL         (WDT_BA+0x00)  /*!< WDT Control Register              */
    #define     REG_WDT_ALTCTL      (WDT_BA+0x04)  /*!< WDT Alternative Control Register  */
    #define     REG_WDT_RSTCNT      (WDT_BA+0x08)  /*!< WDT Reset Counter Register        */
    /**@}*/ /* end of WDT register group */

    /*---------------------- WWDT Controller -------------------------*/
    /**
    @addtogroup WWDT Window Watch Dog Timer Controller(WWDT)
    Memory Mapped Structure for WWDT Controller
    @{ */

    #define     REG_WWDT_RLDCNT     (WWDT_BA+0x00)  /*!< WWDT Reload Counter Register             */
    #define     REG_WWDT_CTL        (WWDT_BA+0x04)  /*!< WWDT Control Register                    */
    #define     REG_WWDT_STATUS     (WWDT_BA+0x08)  /*!< WWDT Status Register                     */
    #define     REG_WWDT_CNT        (WWDT_BA+0x0C)  /*!< WWDT Counter Value Register              */

    /**@}*/ /* end of WWDT register group */

    /*---------------------- SC Host Interface -------------------------*/
    /**
    @addtogroup SC Smart Card Host Interface (SC)
    Memory Mapped Structure for Smart Card Host Interface
    @{ */

    #define     REG_SC0_DAT     (SC0_BA+0x00)  /*!< SC0 Receiving/Transmit Holding Buffer Register */
    #define     REG_SC0_CTL     (SC0_BA+0x04)  /*!< SC0 Control Register */
    #define     REG_SC0_ALTCTL  (SC0_BA+0x08)  /*!< SC0 Alternate Control Register  */
    #define     REG_SC0_EGT     (SC0_BA+0x0C)  /*!< SC0 Extend Guard Time Register  */
    #define     REG_SC0_RXTOUT  (SC0_BA+0x10)  /*!< SC0 Receive Buffer Time-out Register */
    #define     REG_SC0_ETUCTL  (SC0_BA+0x14)  /*!< SC0 ETU Control Register */
    #define     REG_SC0_INTEN   (SC0_BA+0x18)  /*!< SC0 Interrupt Enable Control Register */
    #define     REG_SC0_INTSTS  (SC0_BA+0x1C)  /*!< SC0 Interrupt Status Register */
    #define     REG_SC0_STATUS  (SC0_BA+0x20)  /*!< SC0 Status Register */
    #define     REG_SC0_PINCTL  (SC0_BA+0x24)  /*!< SC0 Pin Control State Register */
    #define     REG_SC0_TMRCTL0 (SC0_BA+0x28)  /*!< SC0 Internal Timer Control Register 0 */
    #define     REG_SC0_TMRCTL1 (SC0_BA+0x2C)  /*!< SC0 Internal Timer Control Register 1 */
    #define     REG_SC0_TMRCTL2 (SC0_BA+0x30)  /*!< SC0 Internal Timer Control Register 2 */
    #define     REG_SC0_UARTCTL (SC0_BA+0x34)  /*!< SC0 UART Mode Control Register */
    #define     REG_SC0_ACTCTL  (SC0_BA+0x4C)  /*!< SC0 Activation Control Register */

    #define     REG_SC1_DAT     (SC1_BA+0x00)  /*!< SC1 Receiving/Transmit Holding Buffer Register */
    #define     REG_SC1_CTL     (SC1_BA+0x04)  /*!< SC1 Control Register */
    #define     REG_SC1_ALTCTL  (SC1_BA+0x08)  /*!< SC1 Alternate Control Register  */
    #define     REG_SC1_EGT     (SC1_BA+0x0C)  /*!< SC1 Extend Guard Time Register  */
    #define     REG_SC1_RXTOUT  (SC1_BA+0x10)  /*!< SC1 Receive Buffer Time-out Register */
    #define     REG_SC1_ETUCTL  (SC1_BA+0x14)  /*!< SC1 ETU Control Register */
    #define     REG_SC1_INTEN   (SC1_BA+0x18)  /*!< SC1 Interrupt Enable Control Register */
    #define     REG_SC1_INTSTS  (SC1_BA+0x1C)  /*!< SC1 Interrupt Status Register */
    #define     REG_SC1_STATUS  (SC1_BA+0x20)  /*!< SC1 Status Register */
    #define     REG_SC1_PINCTL  (SC1_BA+0x24)  /*!< SC1 Pin Control State Register */
    #define     REG_SC1_TMRCTL0 (SC1_BA+0x28)  /*!< SC1 Internal Timer Control Register 0 */
    #define     REG_SC1_TMRCTL1 (SC1_BA+0x2C)  /*!< SC1 Internal Timer Control Register 1 */
    #define     REG_SC1_TMRCTL2 (SC1_BA+0x30)  /*!< SC1 Internal Timer Control Register 2 */
    #define     REG_SC1_UARTCTL (SC1_BA+0x34)  /*!< SC1 UART Mode Control Register */
    #define     REG_SC1_ACTCTL  (SC1_BA+0x4C)  /*!< SC1 Activation Control Register 1 */

    /**@}*/ /* end of SC register group */


    /*---------------------- Advance Interrupt Controller -------------------------*/
    /**
    @addtogroup AIC Advance Interrupt Controller(AIC)
    Memory Mapped Structure for AIC Controller
    @{ */

    #define     REG_AIC_SRCCTL0    (AIC_BA+0x00)    /* Source control register 0 */
    #define     REG_AIC_SRCCTL1    (AIC_BA+0x04)    /* Source control register 1 */
    #define     REG_AIC_SRCCTL2    (AIC_BA+0x08)    /* Source control register 2 */
    #define     REG_AIC_SRCCTL3    (AIC_BA+0x0C)    /* Source control register 3 */
    #define     REG_AIC_SRCCTL4    (AIC_BA+0x10)    /* Source control register 4 */
    #define     REG_AIC_SRCCTL5    (AIC_BA+0x14)    /* Source control register 5 */
    #define     REG_AIC_SRCCTL6    (AIC_BA+0x18)    /* Source control register 6 */
    #define     REG_AIC_SRCCTL7    (AIC_BA+0x1C)    /* Source control register 7 */
    #define     REG_AIC_SRCCTL8    (AIC_BA+0x20)    /* Source control register 8 */
    #define     REG_AIC_SRCCTL9    (AIC_BA+0x24)    /* Source control register 9 */
    #define     REG_AIC_SRCCTL10   (AIC_BA+0x28)    /* Source control register 10 */
    #define     REG_AIC_SRCCTL11   (AIC_BA+0x2C)    /* Source control register 11 */
    #define     REG_AIC_SRCCTL12   (AIC_BA+0x30)    /* Source control register 12 */
    #define     REG_AIC_SRCCTL13   (AIC_BA+0x34)    /* Source control register 13 */
    #define     REG_AIC_SRCCTL14   (AIC_BA+0x38)    /* Source control register 14 */
    #define     REG_AIC_SRCCTL15   (AIC_BA+0x3C)    /* Source control register 15 */
    #define     REG_AIC_RAWSTS0    (AIC_BA+0x100)   /* Interrupt raw status register */
    #define     REG_AIC_RAWSTS1    (AIC_BA+0x104)   /* Interrupt raw status register (Hign) */
    #define     REG_AIC_ACTSTS0    (AIC_BA+0x108)   /* Interrupt active status register */
    #define     REG_AIC_ACTSTS1    (AIC_BA+0x10C)   /* Interrupt active status register (Hign) */
    #define     REG_AIC_INTSTS0    (AIC_BA+0x110)   /* Interrupt status register */
    #define     REG_AIC_INTSTS1    (AIC_BA+0x114)   /* Interrupt status register (High) */
    #define     REG_AIC_IRQNUM     (AIC_BA+0x120)   /* Interrupt source number register */
    #define     REG_AIC_FIQNUM     (AIC_BA+0x124)   /* Output interrupt status register */
    #define     REG_AIC_INTMSK0    (AIC_BA+0x128)   /* Interrupt mask register */
    #define     REG_AIC_INTMSK1    (AIC_BA+0x12C)   /* Interrupt mask register (High) */
    #define     REG_AIC_INTEN0     (AIC_BA+0x130)   /* Mask enable command register */
    #define     REG_AIC_INTEN1     (AIC_BA+0x134)   /* Mask enable command register (High) */
    #define     REG_AIC_INTDIS0    (AIC_BA+0x138)   /* Mask disable command register */
    #define     REG_AIC_INTDIS1    (AIC_BA+0x13C)   /* Mask disable command register (High) */
    #define     REG_AIC_EOIS       (AIC_BA+0x150)   /* End of service command register */
    #define     REG_AIC_EOFS       (AIC_BA+0x154)   /* End of service command register */

    /**@}*/ /* end of AIC register group */


    /*---------------------- Real Time Clock Controller -------------------------*/
    /**
    @addtogroup RTC Real Time Clock Controller(RTC)
    Memory Mapped Structure for RTC Controller
    @{ */

