RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    #define     REG_RTC_INIT    (RTC_BA+0x00)   /*!< RTC Initiation Register */
    #define     REG_RTC_RWEN    (RTC_BA+0x04)   /*!< RTC Access Enable Register */
    #define     REG_RTC_FREQADJ (RTC_BA+0x08)   /*!< RTC Frequency Compensation Register */
    #define     REG_RTC_TIME    (RTC_BA+0x0C)   /*!< Time Loading Register */
    #define     REG_RTC_CAL     (RTC_BA+0x10)   /*!< Calendar Loading Register */
    #define     REG_RTC_TIMEFMT (RTC_BA+0x14)   /*!< Time Format Selection Register */
    #define     REG_RTC_WEEKDAY (RTC_BA+0x18)   /*!< Day of the Week Register */
    #define     REG_RTC_TALM    (RTC_BA+0x1C)   /*!< Time Alarm Register */
    #define     REG_RTC_CALM    (RTC_BA+0x20)   /*!< Calendar Alarm Register */
    #define     REG_RTC_LEAPYEAR    (RTC_BA+0x24)   /*!< Leap year Indicator Register */
    #define     REG_RTC_INTEN   (RTC_BA+0x28)   /*!< RTC Interrupt Enable Register */
    #define     REG_RTC_INTSTS  (RTC_BA+0x2C)   /*!< RTC Interrupt Indicator Register */
    #define     REG_RTC_TICK    (RTC_BA+0x30)   /*!< RTC Time Tick Register */
    #define     REG_RTC_PWRCTL      (RTC_BA+0x34)   /*!< Power Control Register */
    #define     REG_RTC_PWRCNT      (RTC_BA+0x38)   /*!< Power Control Counter Register */
    #define     REG_RTC_SPR0        (RTC_BA+0x40)   /*!< Spare REgistger 0 */
    #define     REG_RTC_SPR1        (RTC_BA+0x44)   /*!< Spare REgistger 1 */
    #define     REG_RTC_SPR2        (RTC_BA+0x48)   /*!< Spare REgistger 2 */
    #define     REG_RTC_SPR3        (RTC_BA+0x4C)   /*!< Spare REgistger 3 */
    #define     REG_RTC_SPR4        (RTC_BA+0x50)   /*!< Spare REgistger 4 */
    #define     REG_RTC_SPR5        (RTC_BA+0x54)   /*!< Spare REgistger 5 */
    #define     REG_RTC_SPR6        (RTC_BA+0x58)   /*!< Spare REgistger 6 */
    #define     REG_RTC_SPR7        (RTC_BA+0x5C)   /*!< Spare REgistger 7 */
    #define     REG_RTC_SPR8        (RTC_BA+0x60)   /*!< Spare REgistger 8 */
    #define     REG_RTC_SPR9        (RTC_BA+0x64)   /*!< Spare REgistger 9 */
    #define     REG_RTC_SPR10       (RTC_BA+0x68)   /*!< Spare REgistger 10 */
    #define     REG_RTC_SPR11       (RTC_BA+0x6C)   /*!< Spare REgistger 11 */
    #define     REG_RTC_SPR12       (RTC_BA+0x70)   /*!< Spare REgistger 12 */
    #define     REG_RTC_SPR13       (RTC_BA+0x74)   /*!< Spare REgistger 13 */
    #define     REG_RTC_SPR14       (RTC_BA+0x78)   /*!< Spare REgistger 14 */
    #define     REG_RTC_SPR15       (RTC_BA+0x7C)   /*!< Spare REgistger 15 */

    /**@}*/ /* end of RTC register group */



    /*---------------------- Pulse Width Modulation Controller -------------------------*/
    /**
    @addtogroup PWM Pulse Width Modulation Controller(PWM)
    Memory Mapped Structure for PWM Controller
    @{ */

    #define     REG_PWM0_PPR     (PWM0_BA+0x00)  /*!< PWM Pre-scale Register 0 */
    #define     REG_PWM0_CSR     (PWM0_BA+0x04)  /*!< PWM Clock Select Register */
    #define     REG_PWM0_PCR     (PWM0_BA+0x08)  /*!< PWM Control Register */
    #define     REG_PWM0_CNR0    (PWM0_BA+0x0C)  /*!< PWM Counter Register 0 */
    #define     REG_PWM0_CMR0    (PWM0_BA+0x10)  /*!< PWM Comparator Register 0 */
    #define     REG_PWM0_PDR0    (PWM0_BA+0x14)  /*!< PWM Data Register 0 */
    #define     REG_PWM0_CNR1    (PWM0_BA+0x18)  /*!< PWM Counter Register 1 */
    #define     REG_PWM0_CMR1    (PWM0_BA+0x1C)  /*!< PWM Comparator Register 1 */
    #define     REG_PWM0_PDR1    (PWM0_BA+0x20)  /*!< PWM Data Register 1 */
    #define     REG_PWM0_CNR2    (PWM0_BA+0x24)  /*!< PWM Counter Register 2 */
    #define     REG_PWM0_CMR2    (PWM0_BA+0x28)  /*!< PWM Comparator Register 2 */
    #define     REG_PWM0_PDR2    (PWM0_BA+0x2C)  /*!< PWM Data Register 2 */
    #define     REG_PWM0_CNR3    (PWM0_BA+0x30)  /*!< PWM Counter Register 3 */
    #define     REG_PWM0_CMR3    (PWM0_BA+0x34)  /*!< PWM Comparator Register 3 */
    #define     REG_PWM0_PDR3    (PWM0_BA+0x38)  /*!< PWM Data Register 3 */
    #define     REG_PWM0_PIER    (PWM0_BA+0x3C)  /*!< PWM Timer Interrupt Enable Register */
    #define     REG_PWM0_PIIR    (PWM0_BA+0x40)  /*!< PWM Timer Interrupt Identification Register */

    /*---------------------- Analog to Digital Converter -------------------------*/
    /**
    @addtogroup ADC Analog to Digital Converter(ADC)
    Memory Mapped Structure for ADC Controller
    @{ */

    #define REG_ADC_CTL       (ADC_BA+0x000) /*!< ADC Contrl */
    #define REG_ADC_CONF      (ADC_BA+0x004) /*!< ADC Configure */
    #define REG_ADC_IER       (ADC_BA+0x008) /*!< ADC Interrupt Enable Register */
    #define REG_ADC_ISR       (ADC_BA+0x00C) /*!< ADC Interrupt Status Register */
    #define REG_ADC_WKISR     (ADC_BA+0x010) /*!< ADC Wake Up Interrupt Status Register */
    #define REG_ADC_XYDATA    (ADC_BA+0x020) /*!< ADC Touch XY Pressure Data */
    #define REG_ADC_ZDATA     (ADC_BA+0x024) /*!< ADC Touch Z Pressure Data */
    #define REG_ADC_DATA      (ADC_BA+0x028) /*!< ADC Normal Conversion Data */
    #define REG_ADC_VBADATA   (ADC_BA+0x02C) /*!< ADC Battery Detection Data */
    #define REG_ADC_KPDATA    (ADC_BA+0x030) /*!< ADC Key Pad Data */
    #define REG_ADC_SELFDATA  (ADC_BA+0x034) /*!< ADC Self-Test Data */
    #define REG_ADC_XYSORT0   (ADC_BA+0x1F4) /*!< ADC Touch XY Position Mean Value Sort 0 */
    #define REG_ADC_XYSORT1   (ADC_BA+0x1F8) /*!< ADC Touch XY Position Mean Value Sort 1 */
    #define REG_ADC_XYSORT2   (ADC_BA+0x1FC) /*!< ADC Touch XY Position Mean Value Sort 2 */
    #define REG_ADC_XYSORT3   (ADC_BA+0x200) /*!< ADC Touch XY Position Mean Value Sort 3 */
    #define REG_ADC_ZSORT0    (ADC_BA+0x204) /*!< ADC Touch Z Pressure Mean Value Sort 0 */
    #define REG_ADC_ZSORT1    (ADC_BA+0x208) /*!< ADC Touch Z Pressure Mean Value Sort 1 */
    #define REG_ADC_ZSORT2    (ADC_BA+0x20C) /*!< ADC Touch Z Pressure Mean Value Sort 2 */
    #define REG_ADC_ZSORT3    (ADC_BA+0x210) /*!< ADC Touch Z Pressure Mean Value Sort 3 */
    #define REG_ADC_MTMULCK   (ADC_BA+0x220) /*!< ADC Manual Test Mode Unlock */
    #define REG_ADC_MTCONF    (ADC_BA+0x224) /*!< ADC Manual Test Mode Configure */
    #define REG_ADC_MTCON     (ADC_BA+0x228) /*!< ADC Manual Test Mode Control */
    #define REG_ADC_ADCAII    (ADC_BA+0x22C) /*!< ADC Analog Interface Information */
    #define REG_ADC_ADCAIIRLT (ADC_BA+0x230) /*!< ADC Analog Interface Information Result */

    /**@}*/ /* end of ADC register group */


