RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    /*------------------ Capture Sensor Interface Controller ---------------------*/
    /**
    @addtogroup CAP Capture Engine(CAP)
    Memory Mapped Structure for CAP Controller
    @{ */

    #define REG_CAP0_CTL            (CAP0_BA+0x000)  /*!< Image Capture Interface Control Register */
    #define REG_CAP0_PAR            (CAP0_BA+0x004)  /*!< Image Capture Interface Parameter Register */
    #define REG_CAP0_INT            (CAP0_BA+0x008)  /*!< Image Capture Interface Interrupt Registe */
    #define REG_CAP0_POSTERIZE      (CAP0_BA+0x00C)  /*!< YUV Component Posterizing Factor Register */
    #define REG_CAP0_MD             (CAP0_BA+0x010)  /*!< Motion Detection Register */
    #define REG_CAP0_MDADDR         (CAP0_BA+0x014)  /*!< Motion Detection Output Address Register */
    #define REG_CAP0_MDYADDR        (CAP0_BA+0x018)  /*!< Motion Detection Temp YOutput Address Register */
    #define REG_CAP0_SEPIA          (CAP0_BA+0x01C)  /*!< Sepia Effect Control Register */
    #define REG_CAP0_CWSP           (CAP0_BA+0x020)  /*!< Cropping Window Starting Address Register */
    #define REG_CAP0_CWS            (CAP0_BA+0x024)  /*!< Cropping Window Size Register */
    #define REG_CAP0_PKTSL          (CAP0_BA+0x028)  /*!< Packet Scaling Vertical/Horizontal Factor Register (LSB) */
    #define REG_CAP0_PLNSL          (CAP0_BA+0x02C)  /*!< Planar Scaling Vertical/Horizontal Factor Register (LSB) */
    #define REG_CAP0_FRCTL          (CAP0_BA+0x030)  /*!< Scaling Frame Rate Factor Register */
    #define REG_CAP0_STRIDE         (CAP0_BA+0x034)  /*!< Frame Output Pixel Stride Register */
    #define REG_CAP0_FIFOTH         (CAP0_BA+0x03C)  /*!< FIFO threshold Register */
    #define REG_CAP0_CMPADDR        (CAP0_BA+0x040)  /*!< Compare Packet Memory Base Address Register */
    #define REG_CAP0_PKTSM          (CAP0_BA+0x048)  /*!< Packet Scaling Vertical/Horizontal Factor Register (MSB) */
    #define REG_CAP0_PLNSM          (CAP0_BA+0x04C)  /*!< Planar Scaling Vertical/Horizontal Factor Register (MSB) */
    #define REG_CAP0_CURADDRP       (CAP0_BA+0x050)  /*!< Current Packet System Memory Address Register */
    #define REG_CAP0_CURADDRY       (CAP0_BA+0x054)  /*!< Current Planar Y System Memory Address Register */
    #define REG_CAP0_CURADDRU       (CAP0_BA+0x058)  /*!< Current Planar U System Memory Address Register */
    #define REG_CAP0_CURADDRV       (CAP0_BA+0x05C)  /*!< Current Planar V System Memory Address Register */
    #define REG_CAP0_PKTBA0         (CAP0_BA+0x060)  /*!< System Memory Packet Base Address Register */
    #define REG_CAP0_PKTBA1         (CAP0_BA+0x064)  /*!< System Memory Packet Base Address Register */
    #define REG_CAP0_YBA            (CAP0_BA+0x080)  /*!< System Memory Planar Y Base Address Register */
    #define REG_CAP0_UBA            (CAP0_BA+0x084)  /*!< System Memory Planar U Base Address Register */
    #define REG_CAP0_VBA            (CAP0_BA+0x088)  /*!< System Memory Planar V Base Address Register */

    /**@}*/ /* end of CAP register group */

    /*------------------ SDRAM Interface Controller ---------------------*/
    /**
    @addtogroup SDIC SDRAM Interface Controller(SDIC)
    Memory Mapped Structure for SDIC Controller
    @{ */

    #define REG_SDIC_OPMCTL     (SDIC_BA+0x000)    /*!< SDRAM Controller Operation Mode Control Register */
    #define REG_SDIC_CMD        (SDIC_BA+0x004)    /*!< SDRAM Command Register */
    #define REG_SDIC_REFCTL     (SDIC_BA+0x008)    /*!< SDRAM Controller Refresh Control Register */
    #define REG_SDIC_SIZE0      (SDIC_BA+0x010)    /*!< SDRAM 0 Size Register */
    #define REG_SDIC_SIZE1      (SDIC_BA+0x014)    /*!< SDRAM 1 Size Register */
    #define REG_SDIC_MR         (SDIC_BA+0x018)    /*!< SDRAM Mode Register */
    #define REG_SDIC_EMR        (SDIC_BA+0x01C)    /*!< SDRAM Extended Mode Register */
    #define REG_SDIC_EMR2       (SDIC_BA+0x020)    /*!< SDRAM Extended Mode Register 2 */
    #define REG_SDIC_EMR3       (SDIC_BA+0x024)    /*!< SDRAM Extended Mode Register 3 */
    #define REG_SDIC_TIME       (SDIC_BA+0x028)    /*!< SDRAM Timing Control Register */
    #define REG_SDIC_DQSODS     (SDIC_BA+0x030)    /*!< DQS Output Delay Selection Register */
    #define REG_SDIC_CKDQSDS    (SDIC_BA+0x034)    /*!< Clock and DQS Delay Selection Register */
    #define REG_SDIC_DAENSEL    (SDIC_BA+0x038)    /*!< Data Latch Enable Selection Register */

    /**@}*/ /* end of SDIC register group */

    /*---------------------- Controller Area Network -------------------------*/
    /**
    @addtogroup CAN Controller Area Network(CAN)
    Memory Mapped Structure for CAN Controller
    @{ */

    #define REG_CAN0_CON       (CAN0_BA+0x00) /*!< Control Register */
    #define REG_CAN0_STATUS    (CAN0_BA+0x04) /*!< Status Register */
    #define REG_CAN0_ERR       (CAN0_BA+0x08) /*!< Error Counter Register */
    #define REG_CAN0_BTIME     (CAN0_BA+0x0C) /*!< Bit Time Register */
    #define REG_CAN0_IIDR      (CAN0_BA+0x10) /*!< Interrupt Identifier Register */
    #define REG_CAN0_TEST      (CAN0_BA+0x14) /*!< Test Register */
    #define REG_CAN0_BRPE      (CAN0_BA+0x18) /*!< BRP Extension Register */
    #define REG_CAN0_IF1_CREQ  (CAN0_BA+0x20) /*!< IF1 Command Request Register */
    #define REG_CAN0_IF2_CREQ  (CAN0_BA+0x80) /*!< IF2 Command Request Register */
    #define REG_CAN0_IF1_CMASK (CAN0_BA+0x24) /*!< IF1 Command Mask Register */
    #define REG_CAN0_IF2_CMASK (CAN0_BA+0x84) /*!< IF2 Command Mask Register */
    #define REG_CAN0_IF1_MASK1 (CAN0_BA+0x28) /*!< IF1 Msak 1 Register */
    #define REG_CNA0_IF2_MASK1 (CAN0_BA+0x88) /*!< IF2 Mask 1 Register */
    #define REG_CAN0_IF1_MASK2 (CAN0_BA+0x2C) /*!< IF1 Mask 2 Register */
    #define REG_CAN0_IF2_MASK2 (CAN0_BA+0x8C) /*!< IF2 Mask 2 REgister */
    #define REG_CAN0_IF1_ARB1  (CAN0_BA+0x30) /*!< IF1 Arbitration 1 Register */
    #define REG_CAN0_IF2_ARB1  (CAN0_BA+0x90) /*!< IF2 Arbitration 1 Register */
    #define REG_CAN0_IF1_ARB2  (CAN0_BA+0x34) /*!< IF1 Arbitration 2 Register */
    #define REG_CAN0_IF2_ARB2  (CAN0_BA+0x94) /*!< IF2 Arbitration 2 Register */
    #define REG_CAN0_IF1_MCON  (CAN0_BA+0x38) /*!< IF1 Message Control Register */
    #define REG_CAN0_IF2_MCON  (CAN0_BA+0x98) /*!< IF2 Message Control Register */
    #define REG_CAN0_IF1_DAT_A1 (CAN0_BA+0x3C) /*!< IF1 Data A1 Register */
    #define REG_CAN0_IF1_DAT_A2 (CAN0_BA+0x40) /*!< IF1 Data A2 Register */
    #define REG_CAN0_IF1_DAT_B1 (CAN0_BA+0x44) /*!< IF1 Data B1 Register */
    #define REG_CAN0_IF1_DAT_B2 (CAN0_BA+0x48) /*!< IF1 Data B2 Register */
    #define REG_CAN0_IF2_DAT_A1 (CAN0_BA+0x9C) /*!< IF2 Data A1 Register */
    #define REG_CAN0_IF2_DAT_A2 (CAN0_BA+0xA0) /*!< IF2 Data A2 Register */
    #define REG_CAN0_IF2_DAT_B1 (CAN0_BA+0xA4) /*!< IF2 Data B1 Register */
    #define REG_CAN0_IF2_DAT_B2 (CAN0_BA+0xA8) /*!< IF2 Data B2 Register */
    #define REG_CAN0_TXREQ1     (CAN0_BA+0x100) /*!< Transmission Request Register 1 */
    #define REG_CAN0_TXREQ2     (CAN0_BA+0x104) /*!< Transmission Request Register 2 */
    #define REG_CAN0_NDAT1      (CAN0_BA+0x120) /*!< New Data Register 1 */
    #define REG_CAN0_NDAT2      (CAN0_BA+0x124) /*!< New Data Register 2 */
    #define REG_CAN0_IPND1      (CAN0_BA+0x140) /*!< Interrupt Pending Register 1 */
    #define REG_CAN0_IPND2      (CAN0_BA+0x142) /*!< Interrupt Pending Register 2 */
    #define REG_CAN0_MVLD1      (CAN0_BA+0x160) /*!< Message Valid Register 1 */
    #define REG_CAN0_MVLD2      (CAN0_BA+0x164) /*!< Message Valid Register 2 */
    #define REG_CAN0_WU_EN      (CAN0_BA+0x168) /*!< Wake-up Function Enable */
    #define REG_CAN0_WU_STATUS  (CAN0_BA+0x16C) /*!< Wake-up Function Status */

