RT-Thread/rt-thread/bsp/nuvoton/libraries/nuc980/Driver/Include/nuc980.h
    #define REG_CAN1_CON       (CAN1_BA+0x00) /*!< Control Register */
    #define REG_CAN1_STATUS    (CAN1_BA+0x04) /*!< Status Register */
    #define REG_CAN1_ERR       (CAN1_BA+0x08) /*!< Error Counter Register */
    #define REG_CAN1_BTIME     (CAN1_BA+0x0C) /*!< Bit Time Register */
    #define REG_CAN1_IIDR      (CAN1_BA+0x10) /*!< Interrupt Identifier Register */
    #define REG_CAN1_TEST      (CAN1_BA+0x14) /*!< Test Register */
    #define REG_CAN1_BRPE      (CAN1_BA+0x18) /*!< BRP Extension Register */
    #define REG_CAN1_IF1_CREQ  (CAN1_BA+0x20) /*!< IF1 Command Request Register */
    #define REG_CAN1_IF2_CREQ  (CAN1_BA+0x80) /*!< IF2 Command Request Register */
    #define REG_CAN1_IF1_CMASK (CAN1_BA+0x24) /*!< IF1 Command Mask Register */
    #define REG_CAN1_IF2_CMASK (CAN1_BA+0x84) /*!< IF2 Command Mask Register */
    #define REG_CAN1_IF1_MASK1 (CAN1_BA+0x28) /*!< IF1 Msak 1 Register */
    #define REG_CNA1_IF2_MASK1 (CAN1_BA+0x88) /*!< IF2 Mask 1 Register */
    #define REG_CAN1_IF1_MASK2 (CAN1_BA+0x2C) /*!< IF1 Mask 2 Register */
    #define REG_CAN1_IF2_MASK2 (CAN1_BA+0x8C) /*!< IF2 Mask 2 REgister */
    #define REG_CAN1_IF1_ARB1  (CAN1_BA+0x30) /*!< IF1 Arbitration 1 Register */
    #define REG_CAN1_IF2_ARB1  (CAN1_BA+0x90) /*!< IF2 Arbitration 1 Register */
    #define REG_CAN1_IF1_ARB2  (CAN1_BA+0x34) /*!< IF1 Arbitration 2 Register */
    #define REG_CAN1_IF2_ARB2  (CAN1_BA+0x94) /*!< IF2 Arbitration 2 Register */
    #define REG_CAN1_IF1_MCON  (CAN1_BA+0x38) /*!< IF1 Message Control Register */
    #define REG_CAN1_IF2_MCON  (CAN1_BA+0x98) /*!< IF2 Message Control Register */
    #define REG_CAN1_IF1_DAT_A1 (CAN1_BA+0x3C) /*!< IF1 Data A1 Register */
    #define REG_CAN1_IF1_DAT_A2 (CAN1_BA+0x40) /*!< IF1 Data A2 Register */
    #define REG_CAN1_IF1_DAT_B1 (CAN1_BA+0x44) /*!< IF1 Data B1 Register */
    #define REG_CAN1_IF1_DAT_B2 (CAN1_BA+0x48) /*!< IF1 Data B2 Register */
    #define REG_CAN1_IF2_DAT_A1 (CAN1_BA+0x9C) /*!< IF2 Data A1 Register */
    #define REG_CAN1_IF2_DAT_A2 (CAN1_BA+0xA0) /*!< IF2 Data A2 Register */
    #define REG_CAN1_IF2_DAT_B1 (CAN1_BA+0xA4) /*!< IF2 Data B1 Register */
    #define REG_CAN1_IF2_DAT_B2 (CAN1_BA+0xA8) /*!< IF2 Data B2 Register */
    #define REG_CAN1_TXREQ1     (CAN1_BA+0x100) /*!< Transmission Request Register 1 */
    #define REG_CAN1_TXREQ2     (CAN1_BA+0x104) /*!< Transmission Request Register 2 */
    #define REG_CAN1_NDAT1      (CAN1_BA+0x120) /*!< New Data Register 1 */
    #define REG_CAN1_NDAT2      (CAN1_BA+0x124) /*!< New Data Register 2 */
    #define REG_CAN1_IPND1      (CAN1_BA+0x140) /*!< Interrupt Pending Register 1 */
    #define REG_CAN1_IPND2      (CAN1_BA+0x142) /*!< Interrupt Pending Register 2 */
    #define REG_CAN1_MVLD1      (CAN1_BA+0x160) /*!< Message Valid Register 1 */
    #define REG_CAN1_MVLD2      (CAN1_BA+0x164) /*!< Message Valid Register 2 */
    #define REG_CAN1_WU_EN      (CAN1_BA+0x168) /*!< Wake-up Function Enable */
    #define REG_CAN1_WU_STATUS  (CAN1_BA+0x16C) /*!< Wake-up Function Status */

    /**@}*/ /* end of CAN register group */


    /*@}*/ /* end of group REGISTER */


    /** @addtogroup IO_ROUTINE  I/O Routines
    The Declaration of NUC980 I/O Routines
    @{
    */

    typedef volatile unsigned char  vu8;        ///< Define 8-bit unsigned volatile data type
    typedef volatile unsigned short vu16;       ///< Define 16-bit unsigned volatile data type
    typedef volatile unsigned long  vu32;       ///< Define 32-bit unsigned volatile data type

    /**
    * @brief Get a 8-bit unsigned value from specified address
    * @param[in] addr Address to get 8-bit data from
    * @return  8-bit unsigned value stored in specified address
    */
    #define M8(addr)  (*((vu8  *) (addr)))

    /**
    * @brief Get a 16-bit unsigned value from specified address
    * @param[in] addr Address to get 16-bit data from
    * @return  16-bit unsigned value stored in specified address
    * @note The input address must be 16-bit aligned
    */
    #define M16(addr) (*((vu16 *) (addr)))

    /**
    * @brief Get a 32-bit unsigned value from specified address
    * @param[in] addr Address to get 32-bit data from
    * @return  32-bit unsigned value stored in specified address
    * @note The input address must be 32-bit aligned
    */
    #define M32(addr) (*((vu32 *) (addr)))

    /**
    * @brief Set a 32-bit unsigned value to specified I/O port
    * @param[in] port Port address to set 32-bit data
    * @param[in] value Value to write to I/O port
    * @return  None
    * @note The output port must be 32-bit aligned
    */
    #define outpw(port,value)     *((volatile unsigned int *)(port)) = value

    /**
    * @brief Get a 32-bit unsigned value from specified I/O port
    * @param[in] port Port address to get 32-bit data from
    * @return  32-bit unsigned value stored in specified I/O port
    * @note The input port must be 32-bit aligned
    */
    #define inpw(port)            (*((volatile unsigned int *)(port)))

    /**
    * @brief Set a 16-bit unsigned value to specified I/O port
    * @param[in] port Port address to set 16-bit data
    * @param[in] value Value to write to I/O port
    * @return  None
    * @note The output port must be 16-bit aligned
    */
    #define outps(port,value)     *((volatile unsigned short *)(port)) = value

    /**
    * @brief Get a 16-bit unsigned value from specified I/O port
    * @param[in] port Port address to get 16-bit data from
    * @return  16-bit unsigned value stored in specified I/O port
    * @note The input port must be 16-bit aligned
    */
    #define inps(port)            (*((volatile unsigned short *)(port)))

    /**
    * @brief Set a 8-bit unsigned value to specified I/O port
    * @param[in] port Port address to set 8-bit data
    * @param[in] value Value to write to I/O port
    * @return  None
    */
    #define outpb(port,value)     *((volatile unsigned char *)(port)) = value

    /**
    * @brief Get a 8-bit unsigned value from specified I/O port
    * @param[in] port Port address to get 8-bit data from
    * @return  8-bit unsigned value stored in specified I/O port
    */
    #define inpb(port)            (*((volatile unsigned char *)(port)))

    /**
    * @brief Set a 32-bit unsigned value to specified I/O port
    * @param[in] port Port address to set 32-bit data
    * @param[in] value Value to write to I/O port
    * @return  None
    * @note The output port must be 32-bit aligned
    */
    #define outp32(port,value)    *((volatile unsigned int *)(port)) = value

    /**
    * @brief Get a 32-bit unsigned value from specified I/O port
    * @param[in] port Port address to get 32-bit data from
    * @return  32-bit unsigned value stored in specified I/O port
    * @note The input port must be 32-bit aligned
    */
    #define inp32(port)           (*((volatile unsigned int *)(port)))

    /**
    * @brief Set a 16-bit unsigned value to specified I/O port
    * @param[in] port Port address to set 16-bit data
    * @param[in] value Value to write to I/O port
    * @return  None
    * @note The output port must be 16-bit aligned
    */
    #define outp16(port,value)    *((volatile unsigned short *)(port)) = value

    /**
    * @brief Get a 16-bit unsigned value from specified I/O port
    * @param[in] port Port address to get 16-bit data from
    * @return  16-bit unsigned value stored in specified I/O port
    * @note The input port must be 16-bit aligned
    */
    #define inp16(port)           (*((volatile unsigned short *)(port)))

    /**
    * @brief Set a 8-bit unsigned value to specified I/O port
    * @param[in] port Port address to set 8-bit data
    * @param[in] value Value to write to I/O port
    * @return  None
    */
    #define outp8(port,value)     *((volatile unsigned char *)(port)) = value

    /**
    * @brief Get a 8-bit unsigned value from specified I/O port
    * @param[in] port Port address to get 8-bit data from
    * @return  8-bit unsigned value stored in specified I/O port
    */
    #define inp8(port)            (*((volatile unsigned char *)(port)))


    /*@}*/ /* end of group IO_ROUTINE */

    /******************************************************************************/
    /*                Legacy Constants                                            */
    /******************************************************************************/
    /** @addtogroup Legacy_Constants Legacy Constants
    NUC980 Legacy Constants
    @{
    */
    typedef void             *PVOID;    ///< Define void pointer data type
    typedef void              VOID;     ///< Define void data type
    typedef char              BOOL;     ///< Define bool data type
    typedef char             *PBOOL;    ///< Define bool pointer data type

    typedef char              INT8;     ///< Define 8-bit singed data type
    typedef char              CHAR;     ///< Define char data type
    typedef char             *PINT8;    ///< Define 8-bit singed pointer data type
    typedef char             *PCHAR;    ///< Define char pointer data type
    typedef unsigned char     UINT8;    ///< Define 8-bit unsigned data type
    typedef unsigned char     UCHAR;    ///< Define char unsigned data type
    typedef unsigned char    *PUINT8;   ///< Define 8-bit unsigned pointer data type
    typedef unsigned char    *PUCHAR;   ///< Define char unsigned pointer data type
    typedef char             *PSTR;     ///< Define string pointer data type
    typedef const char       *PCSTR;    ///< Define constant string pointer data type

    typedef short             SHORT;    ///< Define short signed data type
    typedef short            *PSHORT;   ///< Define short signed pointer data type
    typedef unsigned short    USHORT;   ///< Define short unsigned data type
    typedef unsigned short   *PUSHORT;  ///< Define short unsigned pointer data type

